CC = cc
NAME = minishell
SRC = main.c ps1.c args.c tokens.c quotes.c
OBJ = $(SRC:.c=.o)
CFLAGS = -Wall -Wextra -Werror -g
RM = rm -rf

define LOGO

\033[1;38;5;208m
               ░██           ░██           ░██                   ░██ ░██
                                           ░██                   ░██ ░██
░█████████████ ░██░████████  ░██ ░███████  ░████████   ░███████  ░██ ░██
░██   ░██  ░██ ░██░██    ░██ ░██░██        ░██    ░██ ░██    ░██ ░██ ░██
░██   ░██  ░██ ░██░██    ░██ ░██ ░███████  ░██    ░██ ░█████████ ░██ ░██
░██   ░██  ░██ ░██░██    ░██ ░██       ░██ ░██    ░██ ░██        ░██ ░██
░██   ░██  ░██ ░██░██    ░██ ░██ ░███████  ░██    ░██  ░███████  ░██ ░██
\033[0m

endef
export LOGO

# Libft
LIBFT_DIR   = Libft
LIBFT       = $(LIBFT_DIR)/libft.a

all: $(NAME)

$(NAME): $(OBJ) $(LIBFT) 
	@echo "$$LOGO"
	@echo "\033[1;32mLIASON DES OBJETS\033[0m"
	$(CC) $(OBJ) $(CFLAGS) -o $@  $(LIBFT) -lreadline

$(LIBFT):
	$(MAKE) -C $(LIBFT_DIR)
	$(MAKE) -C $(LIBFT_DIR) bonus

# .c -> .o
%.o: %.c
	$(CC) $(CFLAGS) -c $< -o $@

clean:
	$(MAKE) -C $(LIBFT_DIR) clean
	$(RM) $(OBJ)

fclean: clean 
	$(MAKE) -C $(LIBFT_DIR) fclean
	$(RM) $(NAME)

re: fclean all

.PHONY: all clean fclean re
